In [1]:
import pandas as pd

In [2]:
weather = pd.read_csv('pittsburgh2013.csv',index_col='Date',parse_dates = True)

parse_dates is used to get a date time object.

In [3]:
weather.loc['2013-7-1':'2013-7-5','PrecipitationIn']

Date
2013-07-01    0.18
2013-07-02    0.14
2013-07-03    0.00
2013-07-04    0.25
2013-07-05    0.02
Name: PrecipitationIn, dtype: float64

### Scalar multiplication

In [4]:
weather.loc['2013-7-1':'2013-7-5','PrecipitationIn'] * 2.54 # to convert to cm

Date
2013-07-01    0.4572
2013-07-02    0.3556
2013-07-03    0.0000
2013-07-04    0.6350
2013-07-05    0.0508
Name: PrecipitationIn, dtype: float64

### Absolute temperature range

In [5]:
week_range = weather.loc['2013-8-1':'2013-8-6',['Min TemperatureF','Max TemperatureF']]

In [6]:
print(week_range)

            Min TemperatureF  Max TemperatureF
Date
2013-08-01                64                80
2013-08-02                62                77
2013-08-03                64                75
2013-08-04                57                73
2013-08-05                55                73
2013-08-06                57                79

In [7]:
week_mean = weather.loc['2013-8-1':'2013-8-6','Mean TemperatureF']
print(week_mean)

Date
2013-08-01    72
2013-08-02    68
2013-08-03    70
2013-08-04    65
2013-08-05    63
2013-08-06    68
Name: Mean TemperatureF, dtype: int64

### Relative temperature range

In [8]:
week_range.divide(week_mean, axis = 'rows') # dividing each row in range with the mean temperature

            Min TemperatureF  Max TemperatureF
Date
2013-08-01          0.888889          1.111111
2013-08-02          0.911765          1.132353
2013-08-03          0.914286          1.071429
2013-08-04          0.876923          1.123077
2013-08-05          0.873016          1.158730
2013-08-06          0.838235          1.161765

### Percentage_change

In [9]:
week_mean.pct_change()*100 # % change of each days mean temperature to the previous day

Date
2013-08-01         NaN
2013-08-02   -5.555556
2013-08-03    2.941176
2013-08-04   -7.142857
2013-08-05   -3.076923
2013-08-06    7.936508
Name: Mean TemperatureF, dtype: float64

### Total olympic medals

In [10]:
gold = pd.read_csv('gold_top5.csv',index_col=0)
silver = pd.read_csv('silver_top5.csv',index_col=0)
bronze = pd.read_csv('bronze_top5.csv',index_col=0)

In [11]:
bronze+silver

                 Total
Country
France           936.0
Germany            NaN
Italy              NaN
Soviet Union    1211.0
United Kingdom  1096.0
United States   2247.0

### .add() method

In [12]:
bronze.add(silver)

                 Total
Country
France           936.0
Germany            NaN
Italy              NaN
Soviet Union    1211.0
United Kingdom  1096.0
United States   2247.0

In [13]:
bronze.add(silver, fill_value = 0)

                 Total
Country
France           936.0
Germany          454.0
Italy            394.0
Soviet Union    1211.0
United Kingdom  1096.0
United States   2247.0

In [14]:
bronze.add(silver,fill_value = 0).add(gold, fill_value = 0)

                 Total
Country
France           936.0
Germany          861.0
Italy            854.0
Soviet Union    2049.0
United Kingdom  1594.0
United States   4335.0